{
    "xrf_v2":{
        "simple": [
            "Stretching, Pouring Water, Drinking Water, Washing Hands, Watering Plants, Wiping Table",
            "Writing, Typing, Reading, Writing on Blackboard, Opening Envelope, Using Mouse",
            "Cutting Fruit, Eating Fruit, Picking Fruit, Taking Medicine, Throwing Garbage, Picking Up Items",
            "Sitting Down, Standing Up, Lying Down, Standing Still, Lying Still, Getting Out of Bed",
            "Walking to Bed, Walking to Chair, Walking to Cabinet, Walking to Window, Walking to Blackboard, Answering Phone",
            "Turning On/Off Eye Protection Lamp, Opening/Closing Curtains, Opening/Closing Windows, Using Phone"
        ],
        "simple_desc": ["The system can recognize actions such as stretching, pouring water, writing, cutting fruit, eating fruit, and taking medicine.",
        "It also detects actions like drinking water, sitting down, turning on/off the eye protection lamp, and opening/closing curtains.",
        "The system can identify activities such as opening/closing windows, typing, opening envelopes, throwing garbage, and picking fruit.",
        "Other actions include picking up items, answering the phone, using a mouse, wiping the table, and writing on the blackboard.",
        "It also recognizes actions like washing hands, using a phone, reading, watering plants, and walking to different locations (e.g., bed, chair, cabinet, window, blackboard).",
        "Finally, the system can detect movements like getting out of bed, standing up, lying down, standing still, and lying still."],
        "detail_desc": [
            "Stretching: Slowly extending arms skyward or legs outward, feeling muscles lengthen, often with a deep breath.",
            "Pouring Water: Tilting a jug gracefully, water cascades into a glass, hand steady to avoid spills.",
            "Writing: Gripping a pen, ink flows onto paper, crafting words with focused, rhythmic strokes.",
            "Cutting Fruit: Slicing through juicy fruit with a sharp knife, hands precise, pieces falling neatly.",
            "Eating Fruit: Biting into a crisp apple or soft berry, savoring sweetness, juice on lips.",
            "Taking Medicine: Popping a pill or sipping syrup, swallowing smoothly with a gulp of water.",
            "Drinking Water: Lifting a cool glass, water refreshes as it slides down the throat.",
            "Sitting Down: Easing onto a cushioned chair, knees bend, body sinks into comfort.",
            "Turning On/Off Eye Protection Lamp: Flicking a switch, soft light glows or fades instantly.",
            "Opening/Closing Curtains: Tugging fabric aside, sunlight floods in, or sliding them shut for shade.",
            "Opening/Closing Windows: Pushing a sash up, fresh air rushes in, or pulling it down quietly.",
            "Typing: Fingers dance across keys, clicks echo, words form swiftly on a glowing screen.",
            "Opening Envelope: Ripping paper with a satisfying tear, revealing a letter nestled inside.",
            "Throwing Garbage: Swinging an arm, trash arcs through the air into a bin effortlessly.",
            "Picking Fruit: Plucking a ripe peach from a branch, fingers gentle, fruit firm.",
            "Picking Up Items: Bending low, hands scoop a fallen book or toy from the floor.",
            "Answering Phone: Pressing a button, a voice crackles through, conversation begins promptly.",
            "Using Mouse: Sliding a mouse, cursor darts across the screen, clicks select with precision.",
            "Wiping Table: Sweeping a damp cloth over wood, crumbs vanish, surface gleams anew.",
            "Writing on Blackboard: Chalk scratches across slate, bold letters emerge in dusty white trails.",
            "Washing Hands: Lathering soap, bubbles foam as hands scrub under warm, running water.",
            "Using Phone: Tapping a vibrant screen, apps open, fingers swipe with casual ease.",
            "Reading: Eyes glide over printed lines, pages turn, imagination stirs with each word.",
            "Watering Plants: Tipping a can, water splashes onto soil, leaves perk up gratefully.",
            "Walking to Bed: Steps soft on the floor, heading toward a cozy, inviting mattress.",
            "Walking to Chair: Striding confidently, nearing a sturdy chair waiting in the corner.",
            "Walking to Cabinet: Pacing steadily, approaching a cabinet filled with hidden treasures.",
            "Walking to Window: Strolling casually, drawn to a window framing the outside world.",
            "Walking to Blackboard: Marching forward, nearing a blackboard ready for fresh ideas.",
            "Getting Out of Bed: Throwing off covers, feet swing to the floor, body rises eagerly.",
            "Standing Up: Pushing up from a chair, legs straighten, posture tall and firm.",
            "Lying Down: Sinking onto a bed, body relaxes, head nestles into a pillow.",
            "Standing Still: Feet planted, body poised, a statue-like calm in quiet stillness.",
            "Lying Still: Stretched flat, breathing slows, a peaceful rest on a soft surface."
        ]
    },
    "xrf55": {
        "simple": [
            "Carrying Weight, Brushing Floor, Cutting, Wearing a Hat, Using the Phone, Throwing Something",
            "Putting Something on the Table, Putting on Clothing, Picking, Drinking, Smoking, Eating",
            "Brushing Teeth, Blow Drying Hair, Brushing Hair, Shaking Hands, Hugging, Handing Something to Someone",
            "Kicking Someone, Hitting Someone with Something, Choking Someone's Neck, Pushing Someone, Body Weight Squats, Tai Chi",
            "Boxing, Weightlifting, Hula Hooping, Jump Rope, Jumping Jacks, High Leg Lift",
            "Waving, Clapping Hands, Falling on the Floor, Jumping, Running, Sitting Down",
            "Standing Up, Turning, Walking, Stretching Oneself, Patting on Shoulder, Playing Erhu",
            "Playing Ukulele, Playing Drum, Stomping, Shaking Head, Nodding, Drawing Circles",
            "Drawing a Cross, Pushing, Pulling, Swiping Left, Swiping Right, Swiping Up, Swiping Down"
        ],
        "simple_desc": [
            "The system can recognize actions like carrying weight, brushing the floor, cutting, wearing a hat, using the phone, and throwing something.",
            "It also detects actions such as putting something on the table, putting on clothing, picking, drinking, smoking, and eating.",
            "The system identifies activities like brushing teeth, blow drying hair, brushing hair, shaking hands, hugging, and handing something to someone.",
            "Other actions include kicking someone, hitting someone with something, choking someone’s neck, pushing someone, body weight squats, and Tai Chi.",
            "It can recognize boxing, weightlifting, hula hooping, jumping rope, jumping jacks, and high leg lifts.",
            "The system detects waving, clapping hands, falling on the floor, jumping, running, and sitting down.",
            "It also identifies standing up, turning, walking, stretching oneself, patting on the shoulder, and playing the Erhu.",
            "Actions like playing the ukulele, playing the drum, stomping, shaking head, nodding, and drawing circles are also recognized.",
            "Finally, it can detect drawing a cross, pushing, pulling, swiping left, swiping right, swiping up, and swiping down."
        ],
        "detail_desc": [
            "Carrying Weight: Holding and transporting an object with effort, arms engaged, and body balanced to support the load.",
            "Brushing Floor: Sweeping a broom across the floor with rhythmic arm movements to clean dust or debris.",
            "Cutting: Using a tool like a knife or scissors with controlled hand motions to slice through an object.",
            "Wearing a Hat: Placing a hat on the head, adjusting it with hands for a snug fit.",
            "Using the Phone: Holding a phone, fingers tapping or swiping the screen, often with focused attention.",
            "Throwing Something: Swinging an arm to release an object with force, aiming it toward a target or away.",
            "Putting Something on the Table: Placing an item onto a surface with a gentle, deliberate hand motion.",
            "Putting on Clothing: Sliding arms or legs into garments, adjusting fabric to fit the body comfortably.",
            "Picking: Grasping an object with fingers or hands and lifting it from a surface or location.",
            "Drinking: Raising a container to the mouth, tilting it to sip liquid, then lowering it.",
            "Smoking: Holding a cigarette or similar item, bringing it to the lips, inhaling, and exhaling smoke.",
            "Eating: Using hands or utensils to bring food to the mouth, chewing and swallowing.",
            "Brushing Teeth: Moving a toothbrush in circular or back-and-forth motions across teeth and gums.",
            "Blow Drying Hair: Holding a dryer, directing warm air at wet hair while combing or tousling it.",
            "Brushing Hair: Running a brush through hair with smooth, repeated strokes to detangle or style.",
            "Shaking Hands: Extending a hand to another person, grasping theirs, and moving up and down briefly.",
            "Hugging: Wrapping arms around another person, pressing bodies together in a warm embrace.",
            "Handing Something to Someone: Extending an arm to pass an object to another person’s hand.",
            "Kicking Someone: Swinging a leg forward with force to strike another person.",
            "Hitting Someone with Something: Using an object in hand to strike another person with controlled force.",
            "Choking Someone’s Neck: Gripping a person’s neck with hands, applying pressure to restrict breathing.",
            "Pushing Someone: Using hands or body to apply force, moving another person away or backward.",
            "Body Weight Squats: Bending knees and lowering hips, then standing back up, using only body weight.",
            "Tai Chi: Performing slow, flowing movements with arms and legs in a meditative, balanced stance.",
            "Boxing: Punching with fists in quick, forceful motions, often with a rhythmic bounce.",
            "Weightlifting: Lifting heavy objects like dumbbells or barbells with controlled muscle effort.",
            "Hula Hooping: Rotating hips to keep a hoop spinning around the waist in a continuous motion.",
            "Jump Rope: Swinging a rope over the head and under the feet, jumping each time it passes.",
            "Jumping Jacks: Spreading arms and legs outward while jumping, then returning to a closed stance.",
            "High Leg Lift: Raising one leg high in front, holding briefly, often for stretching or exercise.",
            "Waving: Moving an arm or hand side to side, typically to signal or greet.",
            "Clapping Hands: Striking palms together to produce a sharp sound, often in rhythm or applause.",
            "Falling on the Floor: Losing balance and dropping to the ground, either intentionally or accidentally.",
            "Jumping: Pushing off with both legs to lift the body into the air, landing after a brief flight.",
            "Running: Moving quickly with alternating leg strides, arms pumping for momentum.",
            "Sitting Down: Lowering the body onto a surface, bending knees and resting hips.",
            "Standing Up: Rising from a seated or crouched position, straightening legs to full height.",
            "Turning: Rotating the body or head to face a different direction, often with a pivot of the feet.",
            "Walking: Stepping forward steadily with alternating legs, arms swinging naturally.",
            "Stretching Oneself: Extending arms, legs, or torso to lengthen muscles, often with a deep breath.",
            "Patting on Shoulder: Tapping someone’s shoulder lightly with an open hand, often as a gesture.",
            "Playing Erhu: Drawing a bow across the strings of an Erhu with one hand while fingering notes with the other.",
            "Playing Ukulele: Strumming or plucking the strings of a ukulele with fingers or a pick.",
            "Playing Drum: Striking a drum surface with hands or sticks in rhythmic patterns.",
            "Stomping: Lifting and slamming a foot down forcefully to make a loud sound or emphasize motion.",
            "Shaking Head: Moving the head side to side or back and forth, often to signal disagreement or dizziness.",
            "Nodding: Tilting the head up and down, typically to indicate agreement or acknowledgment.",
            "Drawing Circles: Moving a hand or tool in a circular pattern to create a round shape.",
            "Drawing a Cross: Making two intersecting lines, one vertical and one horizontal, with a hand or tool.",
            "Pushing: Applying force with hands or body to move an object or person forward or away.",
            "Pulling: Grasping and drawing an object or person toward oneself with effort.",
            "Swiping Left: Sliding a finger or hand horizontally to the left across a surface or screen.",
            "Swiping Right: Sliding a finger or hand horizontally to the right across a surface or screen.",
            "Swiping Up: Sliding a finger or hand vertically upward across a surface or screen.",
            "Swiping Down: Sliding a finger or hand vertically downward across a surface or screen."
        ]
    },
    "wifiTAD":{
        "simple": ["run, walk, jump, wave, bend, stand, sit"],
        "simple_desc": ["The system can recognize actions such as running, walking, jumping, waving, bending, standing, and sitting."],
        "detail_desc": [
                "run: Running involves rapid alternating leg movements, with the body leaning forward, arms swinging naturally to maintain balance, typically accompanied by faster speed and larger strides.",
                "walk: Walking consists of alternating leg steps at a slow and steady pace, with the body upright and arms swinging slightly to maintain rhythm and stability.",
                "jump: Jumping involves pushing off the ground with one or both legs to lift the body into the air, followed by a brief airborne moment and landing, with arms possibly swinging to adjust balance.",
                "wave: Waving is the raising and swinging of an arm (usually one) back and forth, with the hand open or closed, used to greet, bid farewell, or attract attention.",
                "bend: Bending involves tilting the body (typically at the waist or knees) downward or sideways, either as a single motion or sustained posture, often for picking up objects or stretching.",
                "stand: Standing is maintaining an upright position with legs straight to support the body, remaining still or with slight posture adjustments, and arms naturally hanging or resting at the sides.",
                "sit: Sitting involves lowering the body so the hips rest on a surface (e.g., a chair), with legs bent or relaxed, back upright or leaning, and hands typically on the lap or a support."
        ]
    }
}